// mockData/featureLabels.ts
export const featureLabels: { [key: string]: string } = {
  // Общие
  мощность: "Мощность",
  power: "Мощность",
  импеданс: "Сопротивление", 
  impedance: "Сопротивление",
  чувствительность: "Чувствительность",
  sensitivity: "Чувствительность",
  частотныйДиапазон: "Частотный диапазон",
  frequencyRange: "Частотный диапазон",
  частотныйдиапазон: "Частотный диапазон",
  
  // Головные устройства
  экран: "Экран",
  screen: "Экран",
  беспроводныеТехнологии: "Беспроводные технологии",
  беспроводныетехнологии: "Беспроводные технологии",
  wireless: "Беспроводные технологии",
  навигация: "Навигация",
  navigation: "Навигация",
  видеоВходы: "Видеовходы",
  видеовходы: "Видеовходы",
  videoInputs: "Видеовходы",
  тип: "Тип",
  type: "Тип",
  дисплей: "Дисплей",
  display: "Дисплей",
  выходы: "Выходы",
  outputs: "Выходы",
  поддержкаФорматов: "Поддержка форматов",
  поддержкаформатов: "Поддержка форматов",
  formatSupport: "Поддержка форматов",
  
  // Сабвуферы
  диаметр: "Диаметр",
  diameter: "Диаметр",
  сопротивление: "Сопротивление",
  типКорпуса: "Тип корпуса",
  типкорпуса: "Тип корпуса",
  enclosureType: "Тип корпуса",
  
  // Усилители
  классУсиления: "Класс усиления",
  классусиления: "Класс усиления",
  amplifierClass: "Класс усиления",
  регулировкаУровня: "Регулировка уровня",
  регулировкауровня: "Регулировка уровня",
  levelControl: "Регулировка уровня",
  каналы: "Количество каналов",
  channels: "Количество каналов"
};